Tekla Open API Reference for Tekla Structures 2025
Section Methods
The LogicalAreaFilterExpressions.Section type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
LogicalAreaFilterExpressions.Section Class
Tekla.Structures.Filtering.Categories Namespace